## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                 |
|--------|---------------------------------------------------------------------|
| add    | `aws_route53_record.simplify-privacy-statements-alpha-canada-ca-NS` |
| delete | `aws_route53_record.avis-confidentialite-snc-alpha-canada-ca-CNAME` |
|        | `aws_route53_record.privacy-statements-cds-alpha-canada-ca-CNAME`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.avis-confidentialite-snc-alpha-canada-ca-CNAME will be destroyed
  # (because aws_route53_record.avis-confidentialite-snc-alpha-canada-ca-CNAME is not in configuration)
  - resource "aws_route53_record" "avis-confidentialite-snc-alpha-canada-ca-CNAME" {
      - fqdn                             = "avis-confidentialite.snc.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_avis-confidentialite.snc.alpha.canada.ca_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "avis-confidentialite.snc.alpha.canada.ca" -> null
      - records                          = [
          - "behavioural-scallop-nlrxwf5edg8eivh9qeu0ai9p.herokudns.com",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.privacy-statements-cds-alpha-canada-ca-CNAME will be destroyed
  # (because aws_route53_record.privacy-statements-cds-alpha-canada-ca-CNAME is not in configuration)
  - resource "aws_route53_record" "privacy-statements-cds-alpha-canada-ca-CNAME" {
      - fqdn                             = "privacy-statements.cds.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_privacy-statements.cds.alpha.canada.ca_CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "privacy-statements.cds.alpha.canada.ca" -> null
      - records                          = [
          - "radiant-damselfly-fxzk8vc81qdj2jzmuog6ncda.herokudns.com",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.simplify-privacy-statements-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "simplify-privacy-statements-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "simplify-privacy-statements.alpha.canada.ca"
      + records         = [
          + "ns-1385.awsdns-45.org",
          + "ns-161.awsdns-20.com",
          + "ns-1862.awsdns-40.co.uk",
          + "ns-869.awsdns-44.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
